from fastapi import FastAPI
from covid19uncle import ThaiCovid19

thai = ThaiCovid19()

app = FastAPI()
@app.get("/")
async def root():
    return [{'อัพเดต': thai['อัพเดต']},
            {'ผู้ป่วยสะสม': thai['ผู้ป่วยสะสม']},
            {'ผู้ป่วยรายใหม่': thai['ผู้ป่วยรายใหม่']},
            {'ผู้ป่วยรุนแรง': thai['ผู้ป่วยรุนแรง']},
            {'ผู้ป่วยเสียชีวิต': thai['ผู้ป่วยเสียชีวิต']},
            {'ผู้ป่วยกลับบ้านแล้ว': thai['ผู้ป่วยกลับบ้านแล้ว']},
            {'ผู้ป่วยเฝ้าระวังสะสม': thai['ผู้ป่วยเฝ้าระวังสะสม']},
            {'ผู้ป่วยเฝ้าระวังรายใหม่': thai['ผู้ป่วยเฝ้าระวังรายใหม่']},
            {'รักษาพยาบาลอยู่รพ': thai['รักษาพยาบาลอยู่รพ.']},
            {'รักษาพยาบาลกลับบ้าน': thai['รักษาพยาบาลกลับบ้าน']},
            {'รักษาพยาบาลสังเกตอาการ': thai['รักษาพยาบาลสังเกตอาการ']},
            {'ผู้เดินทางที่คัดกรองสะสมจากสนามบิน':
             thai['ผู้เดินทางที่คัดกรองสะสมจากสนามบิน']},
            {'ผู้เดินทางที่คัดกรองสะสมจากท่าเรือ':
             thai['ผู้เดินทางที่คัดกรองสะสมจากท่าเรือ']},
            {'ผู้เดินทางที่คัดกรองสะสมจากด่านพรมแดน':
             thai['ผู้เดินทางที่คัดกรองสะสมจากด่านพรมแดน']},
            {'ผู้เดินทางที่คัดกรองสะสมจากสตม.แจ้งวัฒนะ':
             thai['ผู้เดินทางที่คัดกรองสะสมจากสตม.แจ้งวัฒนะ']},
            {'อ้างอิง': thai['อ้างอิง']}]
